In [1]:
import pandas as pd

In [9]:
data = {'Company' : ['Apple','Apple','FB','FB','Google','Google'],
       'Person': ['Ram','Shyam','John','Ron','Von','Ian'],
       'Sales': [1102,1207,1876,7837,987,345]}

In [10]:
df= pd.DataFrame(data)
df

  Company Person  Sales
0   Apple    Ram   1102
1   Apple  Shyam   1207
2      FB   John   1876
3      FB    Ron   7837
4  Google    Von    987
5  Google    Ian    345

In [14]:
gb = df.groupby('Company')

In [15]:
gb.max()

        Person  Sales
Company
Apple    Shyam   1207
FB         Ron   7837
Google     Von    987

In [16]:
gb.mean()

          Sales
Company
Apple    1154.5
FB       4856.5
Google    666.0